module.exports = {
  common: {
    an_error_occurred: 'حدث خطأ غير متوقع',
    page_not_found: 'الصفحة غير موجودة',
    lesson_not_completed: 'الدرس لم يكتمل بعد، انتظرنا..',
    footer_copyrights: 'ﻷن الهدف من دليل مبرمج هو نشر علوم الحاسوب باللغة العربية، فلا يوجد حقوق على المحتوى ويمكنك استخدامه ونشره بأي وسيلة كانت بدون إذننا مادمت تساهم في نشر هذا العلم.',

    search: 'عن ماذا تبحث؟',
    version: 'اﻹصدار'
  },
  iso: 'ar',
  name: 'دليل مبرمج',
  soon: 'قريباً',
  practical: 'عملي',
  new: 'جديد',
  updated: 'مُعدل',
  copy: 'نسخ',
  copy_done: 'تم النسخ',
  main_menu: 'القائمة الرئيسية',

  header: {
    links: [
      {
        name: 'الرئيسية',
        slug: 'home'
      },
      {
        name: 'أساسيات الحاسوب',
        slug: 'tutorials-computer-book-slug',
        param_book: 'essentials',
        param_slug: 'intro'
      },
      {
        name: 'مبادئ البرمجة والخوارزميات',
        slug: 'tutorials-algorithms-book-slug',
        param_book: 'before-start',
        param_slug: 'intro'
      },
      {
        name: 'اﻹختبارات',
        slug: 'tests',
        disabled: true
      },
      {
        name: 'المدونة',
        slug: 'blog'
      },
    ],
  },
  homepage: {
    meta: {
      title: 'دليل مبرمج - بوابتك لعالم البرمجة',
      description: 'منصة دليل مبرمج: غير ربحية مفتوحة المصدر وهي بوابتك اﻷمثل لعالم البرمجة ودليلك في طريقك إلى احتراف البرمجة وعلوم الحاسوب'
    },
    welcome: {
      title: '{name} بوابتك اﻷمثل لعالم البرمجة',
      description: 'منصة دليل مبرمج هي بوابتك لعالم البرمجة ودليلك في طريقك إلى احتراف البرمجة وعلوم الحاسوب، تعتمد على أسلوب تعلّم تفاعلي وتركّز على مفاهيم البرمجة الحديثة وتقنياتها؛ مناسبة لكل المستويات سواء كنت مبتدئاً في استخدام الحاسوب أو مبتدئاً في البرمجة.. ويرجع ذلك ﻹهتمامنا بالتنظيم الجيّد والدورات مختلفة المستويات.',
      short_description: 'منصة غير ربحية مفتوحة المصدر، وهي بوابتك اﻷمثل لعالم البرمجة ودليلك في طريقك إلى احتراف البرمجة',
      get_started: 'تعلم مبادئ البرمجة',
      get_started_computer: 'تعلم أساسيات الحاسوب',
      blog: 'اقرأ مقالاتنا',
      non_profit: 'منصة مجانية غير ربحية مفتوحة المصدر تهدف إلى نشر علوم البرمجة والحاسوب باللغة العربية',
    },
    slack: {
      title: "انضم إلى مجموعات التعلّم الخاصة بمجتمعنا",
      short_title: "مجموعات التعلّم",
      description: "انضم إلى مجموعات التعلم الخاصة بنا على تطبيق slack، لتكون على تواصل مباشر معنا وتحصل على الدعم واﻹرشاد في طريقك، وتتابع تطوراتنا، وتشترك في فعالياتنا واختباراتنا، ويرافقك طريقَك مجموعة من المبرمجين الجدد، وسيكون هناك درس جديد يومياً على المنصة لذلك تابعنا بإستمرار...",
      only_men: "تنويه: المجموعة للرجال فقط، ولكن الخبر الجيد أن ثمار مجموعات التعلم نقوم بتجميعها وتنسيقها وتنظيمها ثم وضعها في الدروس هنا في المنصة يومياً.",
      button: "انضم لمجموعاتنا اﻵن"
    },
    facebook: {
      title: "انضم إلى مجموعتنا على فيسبوك",
      description: "يمكن للجميع اﻹنضمام لمجموعة فيسبوك الخاصة بنا، ومتابعتها بشكل دوري، وطرح أي استفسار أو مشكلة تواجهك عليها لتجد الرد منّا أو من باقي أعضاء المجموعة تحت إشرافنا، أيضاً يمكنك تقديم اﻹقتراحات واﻷفكار هناك.",
      button: "انضم لمجموعتنا على فيسبوك"
    },
    github: {
      title: "ساهم في التطوير والمحتوى",
      description: "منصة دليل مبرمج مفتوحة المصدر (الكود المصدري متاح للجميع)، ويتعاون في محتواها وتطوير برمجياتها العديد من المبرمجين، والمساهمة متاحة لكل من لديه القدرة على ذلك!",
      button: "ساهم في التطوير والمحتوى"
    },
    tutorials: {
      title: 'دوراتنا التعليمية',
      computer_and_systems: {
        title: "أساسيات الحاسوب واﻷنظمة",
        description: "هذه الدورة مهمة لك إن كنت مبتدئاً في استخدام الحاسوب وتود تعلم البرمجة، فيجب عليك أولاً تعلم وإتقان استخدام الحاسوب واﻷنظمة، كذلك إن كنت محترفاً للحاسوب ستجد مواضيع فائتة عنك في هذه الدورة، فراجعها قبل البدء في دورة مبادئ البرمجة.",
      },
      algorithms: {
        title: "مبادئ البرمجة والخوارزميات وهياكل البيانات",
        description: "تعلم مبادئ البرمجة والخوارزميات وهياكل البيانات هي الخطوة اﻷولى واﻷهم في عالم البرمجة، فإن أتقنت ما في هذه الدورة ستتعلم أي لغة برمجة بسرعة شديدة وسهولة وستبدع في حل المشكلات البرمجية التي تواجهك.",
      },
      javascript: {
        title: "دليل تعلم جافاسكريبت الحديثة",
        description: "رغم دراستنا لمبادئ البرمجة والخوارزميات بلغة جافاسكريبت إلّا أننا مازلنا لم نتعلمها فهذه الدورة ستتعمق في لغة جافاسكريبت وستبدأ فيها بالتطبيق على اللغة في أمثلة واستخدامات متقدمة وممتعة!",
      },
    },
  },
  blog: {
    meta: {
      title: 'مدونة دليل مبرمج',
      description:
        'استكشف وتعلم من مقالات مدونة دليل مبرمج التقنية والبرمجية التي كتبها فريق ومجتمع دليل مبرمج'
    },
    title: 'مدونة دليل مبرمج',
    description:
    'استكشف وتعلم من مقالات مدونة دليل مبرمج التقنية والبرمجية؛ هذه المقالات كتبها وأشرف عليها فريق عمل دليل مبرمج ومجموعة من المبرمجين المحترفين من مجتمع دليل مبرمج ونأمل منها إثراء المحتوى العربي في المجال البرمجي وتصحيح المفاهيم.',
    dalil_team: 'فريق دليل مبرمج',
    dalil_community: 'مجتمع دليل مبرمج',
    contribute: 'وجدت خطأ أو تريد المساهمة في محتوى المقال؟'
  },
  guide: {
    toc_title: 'محتويات الدرس'
  },
  quiz: {
    title: 'اختبار'
  },
  contribute: {
    title: 'المساهمين',
    docs: 'وجدت خطأ أو تريد المساهمة في محتوى الدرس؟',
    blog: 'وجدت خطأ أو تريد المساهمة في محتوى المقال؟',
    edit_on_github: 'عدل الصفحة على Github'
  },
  codeSandbox: {
    open: 'افتح المثال'
  },
  content: {
    tutorials: {
      algorithms: {
        'before-start': 'قبل البدء في البرمجة',
        environment: 'إعداد بيئة العمل',
        fundamentals: 'مستوى ابتدائي',
        intermediate: 'مستوى متوسط',
        advanced: 'مستوى متقدم',
      },
      computer: {
        essentials: 'اﻷساسيات',
        cli: 'سطر اﻷوامر',
        editor: 'محرر النصوص',
      }
    }
  },
  footer: {
    links: {
      tutorials: {
        title: 'الدورات التعليمية',
        computer_and_systems: 'أساسيات الحاسوب واﻷنظمة',
        algorithms: 'مبادئ البرمجة والخوارزميات وهياكل البيانات',
        javascript: 'دليل تعلم جافاسكريبت الحديثة',
      },
      links: {
        title: 'الروابط',
        home: 'الرئيسية',
        blog: 'المدونة',
        tests: 'اﻹختبارات'
      },
      community: {
        title: 'مجتمع دليل مبرمج',
        slack: 'اﻹنضمام إلى مجموعات التعلم',
        github: 'المساهمة في التطوير'
      }
    }
  },
}
